# How to abstract file as database table?
***

In [55]:
import pandas as pd

## Define common functions
***

In [49]:
def EXECUTE_SQL(stmnt):
    stmnt=stmnt.lower()
    if "SELECT".lower() in stmnt:
        if "FROM".lower() in stmnt:
            table_name = stmnt.split(" ")[3]
            if(table_name == 'emp'):
                df = pd.read_csv("emp.csv")
                return df            
        else:
            print("Not a valid statement!")
    else:
        return "Not a valid statement!"

## Read the file using pandas read
***

In [52]:
df = pd.read_csv("emp.csv")
df

   EmpNr  FName LName
0      1   Adam  Hook
1      2    Bob     M
2      3  Chris     J
3      4    Dom     P

## Read the file using SQL Statement
***

In [53]:
EXECUTE_SQL("SELECT * FROM EMP")

   EmpNr  FName LName
0      1   Adam  Hook
1      2    Bob     M
2      3  Chris     J
3      4    Dom     P